Autodesk.Revit.DB.Structure.AnalyticalModel.CloneAdjustment(Autodesk.Revit.DB.Structure.AnalyticalModel,System.Int32)
The method clones the adjustment of one end of the AM on another AM,
with respect to the one of the ends.
One of the Analytical Model ends
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModel.IsModified
Checks if AM has been adjusted from auto-detect at any end.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModel.Disconnect(Autodesk.Revit.DB.Structure.AnalyticalElementSelector)
Unjoin from Hub Element.
selector:
End of the analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.AnalyticalModel.GetOffset(Autodesk.Revit.DB.Structure.AnalyticalElementSelector)
Gets the offset of the analytical model at end.
selector:
End of the analytical model.
Returns:
Offset of analytical model from base analytical model at the given end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
selector is not valid for the Analytical Model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Function only work for curve-based elements.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.SetOffset(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.XYZ)
Sets the offset of the analytical model at end.
selector:
End of analytical model to offset.
offset:
New offset for end of analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Function only work for curve-based elements.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetElementId
Retrieves Element Id of the structural element corresponding to the Analytical Model.
Returns:
Element Id for a structural element.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.HasRigidLinksWith(Autodesk.Revit.DB.ElementId)
Indicates if Analytical Model has Rigid Links with specified element.
Remarks:
This is bidirectional, so this can be used to see if Rigid Links exist from Column to Beam.
neighborId:
neighboring Element, to which Rigid Links may exist.
Returns:
true if Rigid Links exist, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.SetAnalyzeAs(Autodesk.Revit.DB.Structure.AnalyzeAs)
Sets value of Analyze As parameter for this Element.
analyzeAs:
Indicates how Analytical Model is analyzed .
Throws Autodesk.Revit.Exceptions.ArgumentException:
analyzeAs is invalid for analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetAnalyzeAs
Returns value of Analyze As parameter for Analytical Model.
Returns:
AnalyzeAs enumeration, indicating how Analytical Model is analyzed.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.Enable(System.Boolean)
Enables or disables Analytical Model, if the Element allows a one-operation Analytical Model toggle.
enable:
Enable (true) or disable (false) Analytical Model.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsEnabled
Reports whether the Analytical Model is enabled or disabled.
Returns:
True if Analytical Model is enabled, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.SetApproximationDeviation(System.Double)
Adjusts the amount by which approximation is made.
deviation:
Maximum distance from line to actual curve
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support approximation.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetApproximationDeviation
Retrieves amount by which approximation is made.
Returns:
Maximum distance from approximated line to curve.
If approximation does not make sense, then this will be 0.0.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.Approximate(System.Boolean)
Switches between non-approximated (e.g., Curved) Analytical Models
and approximated (made up of lines only) Analytical Models
enableApproximation:
Enable/disable approximated function.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support approximation.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsApproximated
Indicates if Analytical Model is approximated or not.
Returns:
True if the Analytical Model is approximated, false otherwise.
False if approximation is meaningless for Analytical Model.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.EnableAutoDetect(Autodesk.Revit.DB.Structure.AnalyticalDirection,System.Boolean)
Enable or disable Analytical Auto-detect.
Remarks:
It is possible to enable Analytical Auto-detect for one direction and have
it disabled for another direction.
direction:
Direction in which to enable Analytical Auto-detect
enabled:
Turn Analytical Auto-detect on (true) or off (false)
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for Analytical Auto-detect.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This AnalyticalModel cannot disable Auto-detect for direction
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.SetUsesHardPoints(System.Boolean)
Sets Hard Points for the Analytical Model.
hardPoints:
Enable/disable Hard Points (true = enable).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel cannot use Hard Points.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.UsesHardPoints
Indicates if the Analytical Model is using Hard Points during approximation.
Returns:
True if Hard Points are being used, false otherwise.
False if Hard Points are meaningless for Analytical Model.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsElementFullySupported
Indicates if Analytical Model is fully supported.
Returns:
True if Analytical Model is fully supported, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetManualAdjustmentMatchedElements
Retrieves other Element Ids against which the Analytical Model has been adjusted.
Remarks:
This is only meaningful for locked Manual Analytical Adjustment.  When operating
unlocked, the Analytical Model is offset by a certain amount, not against a given Element.
Returns:
Set of Element Ids, representing those Elements against which the Analytical Model has been adjusted.
The set may be empty if Analytical Model is not participating in locked Manual Analytical Adjustment.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsManuallyAdjusted
Indicates if the Analytical Model has been manually adjusted by the user.
Returns:
True if user has manually adjusted the Analytical Model; false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.ResetManualAdjustment
Resets all manual adjustments performed by the user onto the Analytical Model.
Remarks:
Resets all manual adjustment. Therefore, if Analytical Offset is applicable,
that will reset as well.
Success, in this context, is achieved only when the Source resets itself to its original position.
Returns:
Indicates the successful reset of all manual adjustment.
True if reset succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.ManuallyAdjust(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
Perform Manual Analytical Adjustment on analytical model, with respect to another Element
Remarks:
Success is achieved when the Source adjusts itself against the Target.
Additionally, this requires an open transaction on the current document.
Model regeneration is required after the operation.
source:
Which part of Analytical Model needs to change.
target:
Which part of another Analytical Model change should be made against.
Returns:
Indicates the successful completion of the Manual Analytical Adjustment operation.
True if source Element was adjusted successfully, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if source cannot be used as source reference, or if target cannot be used as target reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidForManualAdjustment(Autodesk.Revit.DB.Reference)
Indicates if the identified reference is acceptable for Manual Analytical Adjustment.
Remarks:
This method is useful to determine if a reference is acceptable for Manual Analytical Adjustment in
general.  This looks briefly at the reference, without looking at the specific context.
reference:
Reference that will be examined.
Returns:
True if reference can be used, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidManualAdjustmentTarget(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Indicates if reference is acceptable as a "Target" for Manual Analytical Adjustment.
Remarks:
This method is useful for determining if a reference is acceptable for a target.
In other words, if the reference identifies an Analytical Model portion that can be adjusted against.
target:
Target reference.
source:
Source reference.  This is necessary to avoid illegal conditions.  For instance if Element A
is manually adjusted against Element B, Element B cannot in general be adjusted against Element A.
direction:
Direction in which source Element can be adjusted against target Element.
Returns:
True if reference can be used, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidManualAdjustmentSource(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Indicates if the identified reference is acceptable as a source for Manual Analytical Adjustment.
Remarks:
This method is useful for determining if a reference is acceptable for usage as a "Source".
In other words, if the reference identifies an Analytical Model portion that can be adjusted by the user.
source:
Reference to be examined.
adjustmentDirection:
Direction in which adjustment will occur.
Returns:
True if reference can be used as source; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetAutoDetectMatchedElements(Autodesk.Revit.DB.Structure.AnalyticalDirection)
Retrieves other Element Ids that this Element is Auto-detecting against.
Remarks:
An empty set is a valid return value.  It just means that this Element is
not Auto-detecting against any other Elements in the given direction.
direction:
Direction in which Analytical Auto-detect is being done.
Returns:
A set of Element Ids against which this Element is Auto-detecting.
The set may be empty if this Element is not Auto-detecting against anything.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for Analytical Auto-detect.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsAutoDetectEnabled(Autodesk.Revit.DB.Structure.AnalyticalDirection)
Reports if Analytical Auto-detect for the given direction is enabled.
Remarks:
Just because Auto-detect is enabled in one direction, that does not mean that it
is enabled in a different direction.
direction:
Direction in which Auto-detect behavior may be enabled.
Returns:
True if enabled in the given direction, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for Analytical Auto-detect.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetAnalyticalModelSupports
Retrieves the AnalyticalModelSupport array, which is useful to extract Analytical
Support Information from Elements.
Remarks:
If an Element is not supported by anything, the array returned should be empty.
Returns:
Array of AnalyticalModelSupport objects, each one representing a support.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetAnalyticalModelSketchComponents
Retrieves a collection of AnalyticalModelSketchComponent objects, which are useful for those Analytical Models
that have finer calibration below the Element level.
Remarks:
The AnalyticalModelSketchComponent abstraction is necessary for the those
Elements (currently only Slab) consisting of a Sketch, and each Sketch line has the
potential to have Analytical Model specific items associated with it.  These Analytical
Model artifacts are components of the Slab, not of the individual curves (which have no
Analytical Model).
This form results in writable AnalyticalModelSketchComponents.
Returns:
If the Analytical Model supports Sketch-based adjustment of the Analytical Model,
then this will return an array of AnalyticalModelSketchComponents.  Otherwise, it will
return an empty array.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetRigidLink(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Returns rigid link curve corresponding to selector.
selector:
Identifies from which end of the analytical model to get the Rigid Link.
Returns:
Rigid link satisfying selector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
selector is not valid for this AnalyticalModel.
-or-
Thrown if selector identifies a entire curve instead of just an endpoint.
This is because this only returns one curve, and an entire analytical curve may have
any number of rigid links.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetReference(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Returns a reference to a given curve within the analytical model.
selector:
Specifies where in the analytical model the reference lies.
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
selector is not valid for this AnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetCurve
Returns the single curve of the Analytical Model, if it is only one curve.
Returns:
Single curve of the Analytical Model.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This AnalyticalModel contains more than one single curve.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetPoint
Retrieves point of the Analytical Model.
Returns:
Point of the Analytical Model.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This AnalyticalModel cannot be expressed as a single point.
-or-
Disabled Analytical Model can't be used.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetCurves(Autodesk.Revit.DB.Structure.AnalyticalCurveType)
Retrieves all curves for the Analytical Model of a given type.
Remarks:
If the analytical model contains no curves of the given type, then the returned array may be empty.
curveType:
Which curve type should be returned.
Returns:
An array of curves representing analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetLocalCoordinateSystem
Gets the local coordinate system (LCS) for an analytical model element.
Remarks:
For obtaining LCS at specified point on analytical model element use
Autodesk::Revit::DB::Structure::AnalyticalModelStick::GetLocalCoordinateSystem() or
Autodesk::Revit::DB::Structure::AnalyticalModelSurface.GetLocalCoordinateSystem() methods.
Returns:
Transformation matrix.
Returns null for analytical model elements that do not have local coordinate system.
Origin returned by transform is point for which local coordinate system was calculated.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when called on Isolated Foundation, Wall Foundation or in-place analytical model element.
Those elements do not support local coordinate system.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.ResetLinks
The function is trying to recreate analytical link elements that were deleted by the user.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModel.HasDeletedLinks
Indicates if Analytical Model contains deleted Analytical Links.
Returns:
True if contains, false otherwise.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidRigidLinksOption(Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption)
Indicates if Rigid Links option is valid for the Analytical Model.
rigidLinksOption:
Rigid Links option to validate.
Returns:
True if option is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.CanHaveRigidLinks
Indicates if Analytical Model supports Rigid Links.
Returns:
True if Analytical Model supports Rigid Links; false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsAnalyzeAsValid(Autodesk.Revit.DB.Structure.AnalyzeAs)
Determines if the given Analyze As parameter is valid for this Element.
analyzeAs:
Indicates how Analytical Model is analyzed.
Returns:
True if valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.CanApproximate
Indicates if Analytical Model can be approximated or not.
Returns:
True if Analytical Model can be approximated; false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.SupportsManualAdjustment
Indicates if the Element supports Manual Analytical Adjustment.
Returns:
True if Manual Adjustment is possible, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidSelector(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Indicates if the input selector is valid for the Analytical Model.
selector:
Portion of the analytical model geometry.
Returns:
True if selector is valid for this Analytical Model, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.CanUseHardPoints
Indicates if Analytical Model can use Hard Points.
Returns:
True if Analytical Model can use Hard Points, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsSingleCurve
Indicates if the Analytical Model can be expressed as a single curve.
Returns:
True if Analytical Model can be expressed as a single curve, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsSinglePoint
Indicates if the Analytical Model can be expressed as a single point.
Returns:
True if Analytical Model can be expressed as a single point, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.CanDisableAutoDetect(Autodesk.Revit.DB.Structure.AnalyticalDirection)
Indicates if Analytical Auto-detect can be disabled programmatically
Remarks:
Certain Elements can have Auto-detect enabled (e.g., a Structural Wall)
but the disabling of Auto-detect is undefined.
This is because Auto-detect is actually a setting in the Analytical Projection
parameter, and changing this value from Auto-detect is not defined.
direction:
Direction in which to test whether Analytical Auto-detect can be disabled
Returns:
True if Analytical Auto-detect can be disabled, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for Analytical Auto-detect.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidDirectionForAutoDetect(Autodesk.Revit.DB.Structure.AnalyticalDirection)
Tests if the supplied direction is valid for Analytical Auto-detect.
direction:
Direction in which Auto-detect behavior may be valid.
Returns:
True if direction is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.RigidLinksOption
Indicates if parameters indicate if Rigid Links should be formed.
Remarks:
Rigid Links are the result of an interaction between neighboring Structural Columns and Structural Beams
For Structural Beams:
Enabled:  rigid links will be formed, overriding Structural Column setting.Disabled:  rigid links will not be formed, overriding Structural Column setting.FromColumn:  rigid links may be formed, depending on Structural Column setting.
For Structural Columns:
Enabled:  rigid links will be formed, unless Structural Beam setting overrides.Disabled:  rigid links will not be formed, unless Structural Beam setting overrides.
If rigid links are not applicable to this Analytical Model, this will return Disabled.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: rigidLinksOption is not valid for this Analytical Model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This AnalyticalModel does not support Rigid Links.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel
AnalyticalModel represents the Analytical Model portion of a given Structural Element.
Remarks:
AnalyticalModel is made up of the following information:
Curves, representing the graphical representation of the Element with respect to analysis.Support Information.Adjustment Information, both Manual and Automatic.Parameter Information, including projection, hard points, approximation, and rigid links.Analytical Offset.
Specific options are available in specialized classes:
AnalyticalModelSurface - represents analytical model for Structural Floor, Structural Foundation Slab and Structural Wall.AnalyticalModelStick - represents analytical model for Structural Framing Beam, Structural Framing Brace and Structural Column.AnalyticalModelColumn - represents analytical model for Structural Column.
Since:
2011